src/toir_cf/src/Documents/торо_УстановкаЦелевыхЗначенийПоказателейKPI/торо_УстановкаЦелевыхЗначенийПоказателейKPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_УстановкаЦелевыхЗначенийПоказателейKPI</name>
  <registerRecords>InformationRegister.торо_ЦелевыеЗначенияKPI</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КлючевыеПоказатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.торо_ПоказателиKPI</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КритическоеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КритическийМинимум</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КритическийМаксимум</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеОграниченоПоВремени</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cf/src/Documents/торо_УстановкаЦелевыхЗначенийПоказателейKPI/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
//
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	// Проверяем организацию в табличной части, а не в шапке, 
	// так как для поиска значения используется именно организация в табличной части.
	// На чтение доступен любой документ, хотя бы одна строка которого разрешена.
	// Но изменить можно только документ, у которого все строки разрешены.
	
	// От проверки объекта ремонта в табличной части принято решение отказаться по следующим причинам:
	// 1. Техническая: в производительном варианте работы РЛС есть ограничение, можно проверять не больше 
	// 5 полей в табличной части, при этом одна проверка объекта ремонта съедает все эти 5 полей 
	// (флаг "Принадлежит контрагенту", контрагент, организация, подразделение и ссылка), 
	// так что больше ничего добавить уже не выходит.
	// 2. Логическая: Велика вероятность, что конкретные объекты ремонта в данных документах будут указывать редко, 
	// чаще использя более верхнеуровненые - организацию и подразделение. И в конце концов, никто не мешает 
	// при иуказании объекта ремонта дополнительно заполнить еще организацию и подразделение. 
	// Поэтому, можно пренебречь проверкой этого поля в пользу более значимых.

	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ДляОднойИзСтрок(ЗначениеРазрешено(КлючевыеПоказатели.Организация, NULL КАК ИСТИНА, ПустаяСсылка КАК ИСТИНА)
	|						И ЗначениеРазрешено(КлючевыеПоказатели.Подразделение, NULL КАК ИСТИНА, ПустаяСсылка КАК ИСТИНА))
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ДляВсехСтрок(ЗначениеРазрешено(КлючевыеПоказатели.Организация, ПустаяСсылка КАК ИСТИНА))
	|	И ДляВсехСтрок(ЗначениеРазрешено(КлючевыеПоказатели.Подразделение, ПустаяСсылка КАК ИСТИНА))";

	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецЕсли
